myset = (1, 2, 3, 2, 4, 2)
print(myset)
print(myset.index(2))

print('\n   1.=======================================================================')

x = set('abcde')
y = set('bdxyz')

print(x)
# {'d', 'a', 'e', 'b', 'c'}
print(y)
# {'d', 'z', 'x', 'y', 'b'}
print('\n   2.=======================================================================')

print('e' in x)                                # Проверка вхождения в множество
#True

print(x - y) 		                            # Разность множеств
#set(['a', 'c', 'e'])

print(x | y) 		                            # Объединение множеств
#set(['a', 'c', 'b', 'e', 'd', 'y', 'x', 'z'])

print(x & y) 		                            # Пересечение множеств
#set(['b', 'd'])

print(x ^ y) 		                            # Симметрическая разность (XOR)
#set(['a', 'c', 'e', 'y', 'x', 'z'])


print('\n   3.=======================================================================')

print(x > y, x < y) 	                        # Надмножество, подмножество
#(False, False)

z = x.intersection(y)                   # То же, что и выражение x & y
print(z)
#set(['b', 'd'])

z.add('SPAM')                           # Добавит один элемент
print(z)
# {'b', 'd', 'SPAM'}

print('\n   3.=======================================================================')

z = {'b', 'd', 'SPAM'}
z.update({'X', 'Y'})               # Объединение множеств
print(z)
#set(['Y', 'X', 'b', 'd', 'SPAM'])

z.remove('b')                           # Удалит один элемент
print(z)
#set(['Y', 'X', 'd', 'SPAM'])

print('\n   4.=======================================================================')


S2 = set('spam')                      # Добавить все элементы итерируемого объекта
print(S2)
#{'a', 'p', 's', 'm'}


S = {'s', 'p', 'a', 'm'}
S.add('alot')
print(S)
#{'a', 'p', 's', 'm', 'alot'}

print('\n   5.=======================================================================')


S1 = {1, 2, 3, 4}
print(S1 & {1, 3})                     # Пересечение
# {1, 3}

print({1, 5, 3, 6} | S1)               # Объединение
# {1, 2, 3, 4, 5, 6}

print(S1 - {1, 3, 4})                  # Разность
# {2}

print(S1 > {1, 3})                     # Надмножество
#True




