mylist = ['a', 'b', 'c', 'd','e',]
new_list = mylist[ : : -1]          # реверс
print(new_list)


print([1, 2, 3] + [4, 5, 6])       # Конкатенация
# [1, 2, 3, 4, 5, 6]

print(['Ni!'] * 4 )                # Повторение
# ['Ni!', 'Ni!', 'Ni!', 'Ni!']

print(3 in [1, 2, 3] )             # Проверка на вхождение
# True

for x in [1, 2, 3]:
    print(x, end=', ')            # Итерации
# 1, 2, 3,



L = ['spam', 'Spam', 'SPAM!']

L[0:2] = ['eat', 'more']                # Присваивание срезу: удаление+вставка
print(L)                                # Элементы 0 и 1 были заменены





