import re
result = re.match(r'AV', 'AV Analytics Vidhya AV')
print (result.group(0))
print (result.group())

"""1. Разбить строку по нескольким разделителям
Возможное решение:"""
print('\n1.====================================================================================')


line = 'asdf fjdk;afed,fjek,asdf,foo'           # String has multiple delimiters (";",","," ").
result = re.split(r'[;,\s]', line)
print (result)

#   ['asdf', 'fjdk', 'afed', 'fjek', 'asdf', 'foo']

"""Задача 1: Вернуть первое слово из строки
Сначала попробуем вытащить каждый символ (используя '.')"""

print('\n2.====================================================================================')
line = 'AV is largest Analytics community of India'
result = re.findall(r'.', line )
print (result)

#['A', 'V', ' ', 'i', 's', ' ', 'l', 'a', 'r', 'g', 'e', 's', 't', ' ',
# 'A', 'n', 'a', 'l', 'y', 't', 'i', 'c', 's', ' ', 'c', 'o', 'm', 'm', 'u', 'n', 'i', 't', 'y', ' ',
# 'o', 'f', ' ', 'I', 'n', 'd', 'i', 'a']
#Для того, чтобы в конечный результат не попал пробел, используем вместо . \w.

print('\n3.====================================================================================')

result = re.findall(r'\w', line)
print (result)

#['A', 'V', 'i', 's', 'l', 'a', 'r', 'g', 'e', 's', 't', 'A', 'n', 'a', 'l', 'y', 't', 'i', 'c', 's', 'c', 'o', 'm',
# 'm', 'u', 'n', 'i', 't', 'y', 'o', 'f', 'I', 'n', 'd', 'i', 'a']
#Теперь попробуем достать каждое слово (используя * или +)

print('\n4.====================================================================================')

result = re.findall(r'\w*', line)
print (result)

#['AV', '', 'is', '', 'largest', '', 'Analytics', '', 'community', '', 'of', '', 'India', '']
#И снова в результат попали пробелы, так как * означает «ноль или более символов».
# Для того, чтобы их убрать, используем +:

print('\n5.====================================================================================')

result = re.findall(r'\w+', line)
print (result)

#['AV', 'is', 'largest', 'Analytics', 'community', 'of', 'India']
#Теперь вытащим первое слово, используя ^:

print('\n6.====================================================================================')

result = re.findall(r'^\w+', line)
print (result)

#['AV']
#Если мы используем $ вместо ^, то мы получим последнее слово, а не первое:

print('\n7.====================================================================================')

result = re.findall(r'\w+$', line)
print (result)

#[‘India’]